---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.InappropriateSlopeForPipe
source: html/26a0e05e-7c28-dc2d-9eb6-8ced935b6a28.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.InappropriateSlopeForPipe Property

The slope that you specified could not be applied to this pipe. Please check the items that it is connected to and make sure that they aren't constraining the slope of them.

## Syntax (C#)
```csharp
public static FailureDefinitionId InappropriateSlopeForPipe { get; }
```